## Decision Tree

In [1]:
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [2]:
ttd = pd.read_csv("C:\\Vikram\\Datasets\\titanic.csv")
ttd.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
ttd.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
df1 = ttd.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin', 'Embarked'], axis=1)
df1

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [5]:
from sklearn.preprocessing import LabelEncoder
le_Sex = LabelEncoder()
df1['Sex_n'] = le_Sex.fit_transform(df1.Sex)
df1.shape

(891, 6)

In [6]:
df1.dropna(inplace = True)

In [7]:
# feature selection
features = df1[['Pclass', 'Age', 'Fare', 'Sex_n']]
features.shape

(714, 4)

In [8]:
target = df1.Survived
target.shape

(714,)

In [9]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(features, target, test_size=0.2)
X_train.head()

     Pclass   Age     Fare  Sex_n
132       3  47.0  14.5000      0
664       3  20.0   7.9250      1
370       1  25.0  55.4417      1
843       3  34.5   6.4375      1
818       3  43.0   6.4500      1

In [10]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()

model.fit(X_train, y_train)
print("Decision Tree alogorithm has been fitted successfully.")

Decision Tree alogorithm has been fitted successfully.

In [11]:
model. score(X_test, y_test)

0.7762237762237763

Predicting the whether the person who was "male" with pclass of 2, with fare of $55 and age 30 has servived or not.

Pclass = 2, Age = 30, Fare = 55 and Sex_n = 1

In [12]:
model.predict([[2,30,55,1]])

C:\ProgramData\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

With 75.34% accuracy the model has predicted that the person who was male of age 30 wit pclass of 2 and fare $55 was not survived.